<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('posts')->insert([
        		[
                    'title' 			=> 'شرکت ایرانیان گرافیک',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'type' 				=> 'وب سایت',
                    'thumb' 			=> 'roundicons.png',
                    'image' 			=> 'roundicons-free.png',
                    'created_at' 		=> '2016-01-25 12:00:00',
                    'updated_at' 		=> '2016-01-25 12:00:00'
                ],
                [
                    'title' 			=> 'گروه صنعتی ایران تکنیک',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> '',
                    'type' 				=> 'گرافیک',
                    'thumb' 			=> 'startup-framework-preview.png',
                    'image' 			=> 'startup-framework-preview.png',
                    'created_at' 		=> '2016-01-24 12:00:00',
                    'updated_at' 		=> '2016-01-24 12:00:00'
                ],
                [
                    'title' 			=> 'وب سایت ما بالاخره تمام شد',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'type' 				=> 'وب سایت',
                    'thumb' 			=> 'dreams.png',
                    'image' 			=> 'dreams.png',
                    'created_at' 		=> '2016-01-23 12:00:00',
                    'updated_at' 		=> '2016-01-23 12:00:00'
                ],
                [
                    'title' 			=> 'یک تست واقعی !',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> '',
                    'type' 				=> 'لوگو',
                    'thumb' 			=> 'dreams-preview.png',
                    'image' 			=> 'dreams-preview.png',
                    'created_at' 		=> '2016-01-22 12:00:00',
                    'updated_at' 		=> '2016-01-22 12:00:00'
                ],
                [
                    'title' 			=> 'کافل',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'type' 				=> 'طراحی',
                    'thumb' 			=> 'roundicons.png',
                    'image' 			=> 'roundicons-free.png',
                    'created_at' 		=> '2016-01-20 12:00:00',
                    'updated_at' 		=> '2016-01-20 12:00:00'
                ],
                [
                    'title' 			=> 'شرکت ایرانیان گرافیک',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'type' 				=> 'وب سایت',
                    'thumb' 			=> 'roundicons.png',
                    'image' 			=> 'roundicons-free.png',
                    'created_at' 		=> '2016-01-25 12:00:00',
                    'updated_at' 		=> '2016-01-25 12:00:00'
                ],
                [
                    'title' 			=> 'گروه صنعتی ایران تکنیک',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> '',
                    'type' 				=> 'گرافیک',
                    'thumb' 			=> 'startup-framework-preview.png',
                    'image' 			=> 'startup-framework-preview.png',
                    'created_at' 		=> '2016-01-24 12:00:00',
                    'updated_at' 		=> '2016-01-24 12:00:00'
                ],
                [
                    'title' 			=> 'وب سایت ما بالاخره تمام شد',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'type' 				=> 'وب سایت',
                    'thumb' 			=> 'dreams.png',
                    'image' 			=> 'dreams.png',
                    'created_at' 		=> '2016-01-23 12:00:00',
                    'updated_at' 		=> '2016-01-23 12:00:00'
                ],
                [
                    'title' 			=> 'یک تست واقعی !',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> '',
                    'type' 				=> 'لوگو',
                    'thumb' 			=> 'dreams-preview.png',
                    'image' 			=> 'dreams-preview.png',
                    'created_at' 		=> '2016-01-22 12:00:00',
                    'updated_at' 		=> '2016-01-22 12:00:00'
                ],
                [
                    'title' 			=> 'کافل',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'type' 				=> 'طراحی',
                    'thumb' 			=> 'roundicons.png',
                    'image' 			=> 'roundicons-free.png',
                    'created_at' 		=> '2016-01-20 12:00:00',
                    'updated_at' 		=> '2016-01-20 12:00:00'
                ]
            ]);

		DB::table('likes')->insert([
				'post_id' 		=> 2,
				'ip'			=>'::1',
				'created_at' 	=> '2016-01-25 12:00:00'
			]);
    }
}
