<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        
        DB::table('cats')->insert([

                [ 'title' => 'وب سایت',     'parent' => 0 ],
                [ 'title' => 'طراحی',        'parent' => 0 ],
                [ 'title' => 'طراحی سایت',  'parent' => 1 ],
                [ 'title' => 'رابط کاربری',  'parent' => 1 ],
                [ 'title' => 'قالب سایت',   'parent' => 1 ],
                [ 'title' => 'لوگو',         'parent' => 2 ],
                [ 'title' => 'لوگوتایپ',    'parent' => 2 ],
                [ 'title' => 'ست اداری',     'parent' => 2 ],
                [ 'title' => 'کارت ویزیت',  'parent' => 2 ],
                [ 'title' => 'بروشور',       'parent' => 2 ],
            ]);

        DB::table('posts')->insert([ 
        		[
                    'title' 			=> 'شرکت ایرانیان گرافیک',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'cat_id'            => 3,
                    'thumb' 			=> 'roundicons.png',
                    'image' 			=> 'roundicons-free.png',
                ],
                [
                    'title' 			=> 'گروه صنعتی ایران تکنیک',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> '',
                    'cat_id'            => 9,
                    'thumb' 			=> 'startup-framework-preview.png',
                    'image' 			=> 'startup-framework-preview.png',
                ],
                [
                    'title' 			=> 'وب سایت ما بالاخره تمام شد',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'cat_id'            => 3,
                    'thumb' 			=> 'dreams.png',
                    'image' 			=> 'dreams.png',
                ],
                [
                    'title' 			=> 'یک تست واقعی !',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> '',
                    'cat_id'            => 6,
                    'thumb' 			=> 'dreams-preview.png',
                    'image' 			=> 'dreams-preview.png',
                ],
                [
                    'title' 			=> 'کافل',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'cat_id'            => 8,
                    'thumb' 			=> 'roundicons.png',
                    'image' 			=> 'roundicons-free.png',
                ],
                [
                    'title' 			=> 'شرکت ایرانیان گرافیک',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'cat_id'            => 3,
                    'thumb' 			=> 'roundicons.png',
                    'image' 			=> 'roundicons-free.png',
                ],
                [
                    'title' 			=> 'گروه صنعتی ایران تکنیک',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> '',
                    'cat_id'            => 9,
                    'thumb' 			=> 'startup-framework-preview.png',
                    'image' 			=> 'startup-framework-preview.png',
                ],
                [
                    'title' 			=> 'وب سایت ما بالاخره تمام شد',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'cat_id'            => 3,
                    'thumb' 			=> 'dreams.png',
                    'image' 			=> 'dreams.png',
                ],
                [
                    'title' 			=> 'یک تست واقعی !',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> '',
                    'cat_id'            => 6,
                    'thumb' 			=> 'dreams-preview.png',
                    'image' 			=> 'dreams-preview.png',
                ],
                [
                    'title' 			=> 'کافل',
                    'description' 		=> 'کـامـت از افرادی با تجــربه و علاقــه مــند به طراحــی تـشـکیل شده است کـه هدف اصـلی این گــروه طراحـی و توسعه وب با بـهره گـیری از بـروزتــرین نـرم افزارها و کــدها می باشد، هـمچنین این گـروه تمام تمرکز خود را صرف طراحی و توسـعه وب مـتناسب با نیاز مشــتری کرده است. ما معتـقدیم که ایــده ها مــی توانند از هر جـایی یا هر شـخصی بوجود بیایند واین اصل به ما کمک می کند تا تعریف دیگری از قدرت طراحی و توسعه وب بوجود بیاوریم !',
                    'smalldescription' 	=>'گروه کامت با طراحی هوشمندانه، ساخت بانک های اطلاعاتی بهینه و بهره مندی از آخرین نسخه پی اچ پی و فریمورک هایی چون لاراول، ساخت هسته ای قدرتمند، سریع و ایمن را با توجه به استانداردهای روز دنیا برای شما فراهم می نماید.',
                    'link' 				=> 'http://google.com/',
                    'cat_id'            => 8,
                    'thumb' 			=> 'roundicons.png',
                    'image' 			=> 'roundicons-free.png',
                ]
            ]);
        

    # Role Seeder
        Sentinel::getRoleRepository()->createModel()->create([
            'name' => 'Users',
            'slug' => 'users',
        ]);

        Sentinel::getRoleRepository()->createModel()->create([
            'name' => 'Admins',
            'slug' => 'admins',
        ]);
        $this->command->info('Roles seeded!');

    # User Seeder
        Sentinel::registerAndActivate([
            'email'    => 'user@user.com',
            'password' => 'sentineluser',
            'first_name' => 'UserFirstName',
            'last_name' => 'UserLastName',
        ]);

        Sentinel::registerAndActivate([
            'email'    => 'admin@admin.com',
            'password' => 'sentineladmin',
            'first_name' => 'AdminFirstName',
            'last_name' => 'AdminLastName',
        ]);
        $this->command->info('Users seeded!');

    # User Role Seeder
        $userUser = Sentinel::findByCredentials(['login' => 'user@user.com']);
        $adminUser = Sentinel::findByCredentials(['login' => 'admin@admin.com']);

        $userRole = Sentinel::findRoleByName('Users');
        $adminRole = Sentinel::findRoleByName('Admins');

        $userRole->users()->attach($userUser);
        $adminRole->users()->attach($adminUser);
        $this->command->info('Users assigned to roles seeded!');



    }
}
